## Анализ данных по Титанику

In [1]:
import pandas as pd

In [3]:
# загрузка данных 
data_0 = pd.read_csv("data/titanic.csv")
data_0.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [4]:
data_0.shape

(891, 15)

In [5]:
data_0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [6]:
# ключи столбцов
data_0.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [8]:
# удаление ненужных столбцов
data_1 = data_0.drop(['sibsp', 'parch','embarked','class','adult_male', 'deck','alive', 'alone'], axis=1)
data_1.head(10)

   survived  pclass     sex   age     fare    who  embark_town
0         0       3    male  22.0   7.2500    man  Southampton
1         1       1  female  38.0  71.2833  woman    Cherbourg
2         1       3  female  26.0   7.9250  woman  Southampton
3         1       1  female  35.0  53.1000  woman  Southampton
4         0       3    male  35.0   8.0500    man  Southampton
5         0       3    male   NaN   8.4583    man   Queenstown
6         0       1    male  54.0  51.8625    man  Southampton
7         0       3    male   2.0  21.0750  child  Southampton
8         1       3  female  27.0  11.1333  woman  Southampton
9         1       2  female  14.0  30.0708  child    Cherbourg

In [10]:
# удаление строк с пустыми значениями
data_1 = data_1.dropna()
data_1.shape

(712, 7)

In [11]:
# проверим на дубликаты
data_1.duplicated().sum()

42

In [13]:
# удаление дубликатов
data_1 = data_1.drop_duplicates()
data_1.shape

(670, 7)

In [15]:
# сколько выживших в таблице 
num_surv = data_1["survived"].sum()
num_surv

280

In [16]:
# процент выживаемости
num_surv / data_1.shape[0] * 100

41.7910447761194

In [17]:
# минимальный, средний, максимальный возрасты
data_1['age'].min(), data_1['age'].max(), data_1['age'].mean()

(0.42, 80.0, 29.757343283582088)

In [18]:
# данные при условии "age" == 0.42
mask = data_1['age'] == 0.42

data_1.loc[mask, "survived"]

803    1
Name: survived, dtype: int64

In [19]:
# данные по выжившему
data_1.loc[mask, :]

     survived  pclass   sex   age    fare    who embark_town
803         1       3  male  0.42  8.5167  child   Cherbourg

In [20]:
# уникальные значения по столбцу 
data_1['embark_town'].unique()

array(['Southampton', 'Cherbourg', 'Queenstown'], dtype=object)

In [21]:
# группировка данных
data_1.groupby("survived")[['age', 'pclass']].mean()

                age    pclass
survived
0         30.862821  2.479487
1         28.217571  1.871429

In [23]:
data_1.groupby("pclass")[['survived']].count()

        survived
pclass
1            182
2            155
3            333

In [14]:
data_1.columns

Index(['survived', 'pclass', 'sex', 'age', 'fare', 'who', 'embark_town'], dtype='object')